Revit 2024 API
FailuresAccessor.GetFailureMessages Method
 Provides access to the individual failure messages currently posted in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public IList<FailureMessageAccessor> GetFailureMessages()
Visual Basic
Public Function GetFailureMessages As IList(Of FailureMessageAccessor)
Visual C++
public:
IList<FailureMessageAccessor^>^ GetFailureMessages()
Return Value
 The accessors to the individual failure messages posted in the document.
Remarks
 Returned set of messages will be ordered from more severe to less severe.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
FailuresAccessor Class
GetFailureMessages Overload
Autodesk.Revit.DB Namespace